      *COPY DE COMUNICACAO PROGRAMA HBSIS06P
       01  HBSIS06L.
           05  TIPO-ORD-HBSIS06L      PIC  X(001)         VALUE SPACES.
           05  TIPO-CLA-HBSIS06L      PIC  X(001)         VALUE SPACES.
           05  COD-VEND-HBSIS06L      PIC  9(003)         VALUE ZEROS.
           05  NOME-VEND-HBSIS06L     PIC  X(040)         VALUE SPACES.
           05  COD-RETORNO-HBSIS06L   PIC  9(001)         VALUE ZEROS.
           05  MSG-RETORNO-HBSIS06L   PIC  X(050)         VALUE SPACES.
