      *COPY DE COMUNICACAO PROGRAMA HBSIS07P
       01  HBSIS07L.
           05  COD-RETORNO-HBSIS07L   PIC  9(001)         VALUE ZEROS.
           05  MSG-RETORNO-HBSIS07L   PIC  X(050)         VALUE SPACES.
