      *COPY DO ARQUIVO DE DISTRIBUIÇÃO
       01  ARQ-HBSIS07C.
           05  COD-CLIENTE-HBSIS07C   PIC  9(007)         VALUE ZEROS.
           05  RAZAO-SOCIAL-HBSIS07C  PIC  X(040)         VALUE SPACES.
           05  COD-VENDEDOR-HBSIS07C  PIC  9(003)         VALUE ZEROS.
           05  NOME-VEND-HBSIS07C     PIC  X(040)         VALUE SPACES.
           05  DISTANCIA-HBSIS07C     PIC  9(009)V9(002)  VALUE ZEROS.
