      *COPY DE COMUNICACAO PROGRAMA HBSIS03P
       01  HBSIS03L.
           05  COD-RETORNO-HBSIS03L   PIC  9(001)         VALUE ZEROS.
           05  MSG-RETORNO-HBSIS03L   PIC  X(050)         VALUE SPACES.
