      *COPY DO ARQUIVO DE CLIENTES
       01  ARQ-HBSIS02C.
           05  COD-CLIENTE-HBSIS02C   PIC  9(007)         VALUE ZEROS.
           05  CNPJ-HBSIS02C          PIC  9(014)         VALUE ZEROS.
           05  RAZAO-SOCIAL-HBSIS02C  PIC  X(040)         VALUE SPACES.
           05  LATITUDE-CLI-HBSIS02C  PIC S9(003)V9(008)  VALUE ZEROS.
           05  LONGITUDE-CLI-HBSIS02C PIC S9(003)V9(008)  VALUE ZEROS.
           05  COD-VEND-CLI-HBSIS02C  PIC  9(003)         VALUE ZEROS.
