      *COPY DO ARQUIVO DE VENDEDORES
       01  ARQ-HBSIS04C.
           05  COD-VENDEDOR-HBSIS04C   PIC  9(003)         VALUE ZEROS.
           05  CPF-HBSIS04C            PIC  9(011)         VALUE ZEROS.
           05  NOME-VEND-HBSIS04C      PIC  X(040)         VALUE SPACES.
           05  LATITUDE-VEND-HBSIS04C  PIC S9(003)V9(008)  VALUE ZEROS.
           05  LONGITUDE-VEND-HBSIS04C PIC S9(003)V9(008)  VALUE ZEROS.
